### Staging environment
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.cloudflare_zone.main: Reading...
data.cloudflare_zone.main: Read complete after 0s [id=196a92a2c10bfc2ffd05d0063a5f51b7]
data.azurerm_container_registry.main: Reading...
data.azurerm_client_config.current: Reading...
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjdjZDRhMC0zZDE3LTRhMDUtODNlOS03NGIxMjRjMzIxNGQ7b2JqZWN0SWQ9NmI5N2EwZTMtZDM5OC00YmJmLWIyZmMtNmNjZmUxNzQ4ZDNlO3N1YnNjcmlwdGlvbklkPTE2ZTAxYTAwLWY4MjUtNGM5Ni04YWUyLWU2OGNiNTJjZjY1Mzt0ZW5hbnRJZD1mZmFiMzhkZi1jZGRmLTQzM2YtODU5YS02Y2ZhMTYxYTVjZWI=]
data.azurerm_container_registry.main: Read complete after 1s [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-shared-westeurope-001/providers/Microsoft.ContainerRegistry/registries/crtshortwesteurope001]
azurerm_user_assigned_identity.api: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.ManagedIdentity/userAssignedIdentities/id-tshort-stage-westeurope-001]
azurerm_log_analytics_workspace.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.OperationalInsights/workspaces/log-tshort-stage-westeurope-001]
azurerm_application_insights.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.Insights/components/appi-tshort-stage-westeurope-001]
azurerm_static_web_app.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.Web/staticSites/stapp-tshort-stage-001]
azurerm_role_assignment.api_acr_pull: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-shared-westeurope-001/providers/Microsoft.ContainerRegistry/registries/crtshortwesteurope001/providers/Microsoft.Authorization/roleAssignments/b63c4862-db8b-f2cf-44c7-d568ce41984b]
azurerm_container_app_environment.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.App/managedEnvironments/cae-tshort-stage-westeurope-001]
cloudflare_record.primary: Refreshing state... [id=4f70db14b86b939153a7df9ae5d6b58e]
time_sleep.wait_for_dns_record: Refreshing state... [id=2025-01-02T23:41:06Z]
azurerm_static_web_app_custom_domain.primary: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.Web/staticSites/stapp-tshort-stage-001/customDomains/staging.admin.tshort.me]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_app.api will be created
  + resource "azurerm_container_app" "api" {
      + container_app_environment_id  = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.App/managedEnvironments/cae-tshort-stage-westeurope-001"
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "aca-tshort-api-stage-001"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-tshort-stage-westeurope-001"
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "Staging"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.ManagedIdentity/userAssignedIdentities/id-tshort-stage-westeurope-001",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + ingress {
          + allow_insecure_connections = false
          + custom_domain              = (known after apply)
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 8080
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + identity = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.ManagedIdentity/userAssignedIdentities/id-tshort-stage-westeurope-001"
          + server   = "crtshortwesteurope001.azurecr.io"
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "crtshortwesteurope001.azurecr.io/placeholder"
              + memory            = "0.5Gi"
              + name              = "tshort-api"

              + env {
                  + name  = "APPLICATIONINSIGHTS_CONNECTION_STRING"
                  + value = (sensitive value)
                }
            }
        }
    }

  # azurerm_container_app_custom_domain.api will be created
  + resource "azurerm_container_app_custom_domain" "api" {
      + container_app_environment_managed_certificate_id = (known after apply)
      + container_app_id                                 = (known after apply)
      + id                                               = (known after apply)
      + name                                             = "staging.tshort.me"
    }

  # cloudflare_record.api will be created
  + resource "cloudflare_record" "api" {
      + allow_overwrite = false
      + comment         = "Custom domain for the tshort API stage environment"
      + content         = "aca-tshort-api-stage-001.kindglacier-871e5019.westeurope.azurecontainerapps.io"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "staging"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "196a92a2c10bfc2ffd05d0063a5f51b7"
    }

  # cloudflare_record.asuid_api will be created
  + resource "cloudflare_record" "asuid_api" {
      + allow_overwrite = false
      + comment         = "Azure custom domain verification id"
      + content         = (sensitive value)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "asuid.staging"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "196a92a2c10bfc2ffd05d0063a5f51b7"
    }

  # time_sleep.api_custom_domain_records will be created
  + resource "time_sleep" "api_custom_domain_records" {
      + create_duration = "2m"
      + id              = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>